export const welcomeMessages = (fullName: string, userRole: string) => {
  return `
🌟 **Вітаємо, ${fullName}!** 🌟

Це — професійний інструмент для **автоматизації розкладу уроків**. Забудьте про ручне узгодження часу! ⏳

🚀 **Що вміє цей бот:**

📅 **Керування розкладом:**
• Перегляд календаря (місяць/день)
• Блокування годин та вихідних
• Налаштування робочого часу

💳 **Фінанси та оплата:**
• Прив'язка картки та контроль оплат
• Перевірка балансу 💰
• Автоматичні сповіщення та нагадування 🔔

⚙️ **Налаштування:**
• Додавання посилань на конференції (Zoom/Google Meet)
• Бронювання часу учнями в один клік

---
👤 Ваша роль: \`${userRole == 'teacher' ? 'Вчитель' : 'Учень'}\`
🔄 _Бажаєте протестувати бот з іншою роллю? Напишіть команду:_ /role
`;
};
